---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewInstanceBinding
source: html/0fd54cd1-2d09-b967-25d1-1a8ce80be451.htm
---
# Autodesk.Revit.Creation.Application.NewInstanceBinding Method

Creates a new empty instance binding object.

## Syntax (C#)
```csharp
public InstanceBinding NewInstanceBinding()
```

## Returns
A new instance binding object.

## Remarks
Instance binding objects are used for attaching shared parameter definitions to all
instances of an element within a category. Categories can be added to the instance binding via
the Categories property of the InstanceBinding object